In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('5. London Housing Data.csv')
df.head(3)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN

In [4]:
df.tail(3)

            date     area  average_price       code  houses_sold  no_of_crimes
13546  11/1/2019  england         248515  E92000001      67814.0           NaN
13547  12/1/2019  england         250410  E92000001          NaN           NaN
13548   1/1/2020  england         247355  E92000001          NaN           NaN

In [6]:
df.shape

(13549, 6)

In [7]:
df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [9]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

Q. 1) Convert the Datatype of 'Date' column to Date-Time format.

In [13]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN

In [15]:
df['Year'] = df['date'].apply(lambda x: x.split('/')[2])
df['Month'] = df['date'].apply(lambda x: x.split('/')[0])
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,Year,Month,Day
0,1/1/1995,city of london,91449,E09000001,17.0,NaN,1995,1,1
1,2/1/1995,city of london,82203,E09000001,7.0,NaN,1995,2,1